/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putnbr_fd.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: okaname <okaname@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/10/27 14:23:10 by okaname           #+#    #+#             */
/*   Updated: 2024/10/27 18:14:35 by okaname          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_putnbr_fd(int n, int fd)
{
	if (n < 0)
	{
		write(fd, "-", 1);
		if (n == -2147483648)
		{
			write(fd, "2147483648", 10);
			return ;
		}
		n = -n;
	}
	if (n > 9)
	{
		ft_putnbr_fd(n / 10, fd);
	}
	ft_putchar_fd((n % 10 + '0'), fd);
}
// int	main(void)
// {
// 	ft_putnbr_fd(12345, 1);  // 標準出力に出力
// 	write(1, "\n", 1);       // 改行
// 	ft_putnbr_fd(-67890, 1); // 標準出力に出力
// 	write(1, "\n", 1);       // 改行
// 	ft_putnbr_fd(0, 1);      // 標準出力に出力
// 	write(1, "\n", 1);       // 改行
// 	return (0);
// }
