/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: okaname <okaname@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/10/27 14:15:00 by okaname           #+#    #+#             */
/*   Updated: 2024/10/27 15:26:03 by okaname          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
// int	main(void)
// {
// 	ft_putchar('A', 1); // 標準出力に 'A' を出力
// 	ft_putchar('\n', 1);
// 	ft_putchar('B', 2); // 標準エラー出力に 'B' を出力
// 	ft_putchar('\n', 2);
// 	return (0);
// }
